import { Link } from 'react-router-dom'
import './Header.scss'

export const Header = () => {
	return (
		<header className='Header'>
			<div className='Header__logo'>
				<Link to={'/main'}>
					{/* <svg
						id='tehnikum-logo'
						viewBox='0 0 143 23'
						xmlns='http://www.w3.org/2000/svg'
					>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M13.1657 1.07477H0V4.08411H5.26629V21.9252H8.10198V4.08411H13.1657V1.07477Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M24.0021 23C28.516 23 32.3852 20.0712 34.0145 15.9065H30.3634C29.0072 18.1069 26.6646 19.5607 24.0021 19.5607C20.1157 19.5607 16.9109 16.4631 16.4606 12.4673H34.8385V11.0701C34.8385 10.9925 34.8326 10.9163 34.8211 10.8422C34.4998 4.79698 29.7789 0 24.0021 0C18.0173 0 13.1657 5.14873 13.1657 11.5C13.1657 17.8513 18.0173 23 24.0021 23ZM31.4018 9.6729C30.6218 6.10121 27.6049 3.43925 24.0021 3.43925C20.3993 3.43925 17.3824 6.10121 16.6025 9.6729H31.4018Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M36.864 21.9252V1.07477H39.6997V9.24299H51.6501V1.07477H54.4858V21.9252H51.6501V12.2523H39.6997V21.9252H36.864Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M57.119 21.9252V1.07477H65.221L66.7808 18.9159H69.272V1.07477H72.3102V21.9252H64.0057L62.4458 4.08411H60.1572V21.9252H57.119Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M89.2856 11.5L104.11 4.72897V0.859813L88.3116 8.07571V1.07477H85.2734V21.9252H88.3116V14.9243L104.11 22.1402V18.271L89.2856 11.5Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M106.744 21.9252V1.07477H109.782V18.9159H116.871V1.07477H119.909V21.9252H106.744Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M122.542 21.9252V1.07477H130.037L131.943 18.9159H133.802L135.708 1.07477H143V21.9252H139.962V3.65421H138.471L136.518 21.9252H129.227L127.274 3.65421H125.581V21.9252H122.542Z'
						/>
						<path
							fillRule='evenodd'
							clipRule='evenodd'
							d='M77.3739 18.9159V4.08411H74.5382V1.07477H82.8428V4.08411H80.2096V18.9159H82.8428V21.9252H74.5382V18.9159H77.3739Z'
						/>
					</svg> */}
					<img
						className='Logo_football'
						src='https://static.liveresult.ru/themes/adaptive/images/logo_h.svg'
						alt='logo_diplom'
					/>
				</Link>
			</div>
			<div className='text-center'>
				<span>
					Футбол онлайн — результаты и счета матчей, видео голов и трансляции
				</span>
			</div>
			<div className='input-wrapper'>
				<input type='search' id='search' name='search' placeholder='Поиск' />
				<svg
					className='icon icon-search'
					viewBox='0 0 18 18'
					xmlns='http://www.w3.org/2000/svg'
				>
					<path
						id='glass'
						d='M13.1988 11.6083H12.3648L12.0691 11.3234C12.7289 10.5574 13.2112 9.65499 13.4813 8.6809C13.7514 7.70682 13.8028 6.6851 13.6317 5.68886C13.1355 2.7555 10.6861 0.413034 7.72986 0.0542773C6.69056 -0.0771269 5.63496 0.0308227 4.64383 0.369866C3.6527 0.708908 2.75231 1.27006 2.01155 2.01038C1.2708 2.75069 0.709324 3.65056 0.370083 4.64111C0.0308408 5.63166 -0.0771721 6.68664 0.0543092 7.72533C0.413276 10.6798 2.75712 13.1278 5.6922 13.6237C6.68902 13.7947 7.71134 13.7434 8.68599 13.4734C9.66065 13.2034 10.5635 12.7215 11.3301 12.0621L11.6151 12.3575V13.1911L16.1022 17.6755C16.5351 18.1082 17.2425 18.1082 17.6753 17.6755C18.1082 17.2429 18.1082 16.536 17.6753 16.1033L13.1988 11.6083ZM6.86412 11.6083C4.23521 11.6083 2.11309 9.48745 2.11309 6.86009C2.11309 4.23273 4.23521 2.11185 6.86412 2.11185C9.49302 2.11185 11.6151 4.23273 11.6151 6.86009C11.6151 9.48745 9.49302 11.6083 6.86412 11.6083Z'
					/>
				</svg>
			</div>
			<div className='profile-wrapper'>
				<Link to={'/profile'}>
					<img
						className='_no-select'
						src='./img/users/Frame1.png'
						alt='Profile'
					/>
					<span>Вход</span>
				</Link>
			</div>
		</header>
	)
}
